Repository: andryunin/goodboy
Catalog: src/goodboy/locale/*/LC_MESSAGES/goodboy.po
Languages: ru

source: cannot be None
ru: не может быть None

source: cannot be null
ru: не может быть null

source: cannot be blank
ru: не может быть пустым

source: must be None
ru: ожидается значение None

source: must be null
ru: ожидается значение null

source: expected type is "{expected_type}"
ru: ожидается тип "{expected_type}"

source: value is not allowed
ru: непредусмотренное значение

source: must be later than {value}
ru: должно быть позже {value}

source: must be later or equal to {value}
ru: должно быть позже либо равно {value}

source: must be earlier than {value}
ru: должно быть раньше {value}

source: must be earlier or equal to {value}
ru: должно быть раньше или равно {value}

source: invalid date format
ru: неверный формат даты

source: invalid date and time format
ru: неверный формат даты и времени

source: must be less than {value}
ru: должно быть меньше {value}

source: must be less or equal to {value}
ru: должно быть меньше или равно {value}

source: must be greater than {value}
ru: должно быть больше {value}

source: must be greater or equal to {value}
ru: должно быть больше либо равно {value}

source: invalid integer format
ru: не является целым числом

source: invalid numeric format
ru: не является числом

source: invalid string format
ru: не является строкой

source: must be {value} characters long
ru: неверной длины (должно быть ровно {value} символов)

source: must be shorter than {value} characters
ru: должно быть короче {value} символов

source: must be longer than {value} characters
ru: должно быть длинее {value} символов

source: must be valid regex
ru: должно быть корректным регулярным выражением

source: key errors
ru: ошибки в ключах

source: value errors
ru: ошибки в значениях

source: key is required
ru: ключ обязателен

source: unknown key
ru: неизвестный ключ

source: must be {value} items long
ru: неверной длины (должно быть ровно {value} элементов)

source: must be shorter than {value} items
ru: должно быть короче {value} элементов

source: must be longer than {value} items
ru: должно быть длинее {value} элементов

source: does not match any of the variants
ru: не соответствует ни одному из вариантов

source: object is not callable
ru: объект не является вызываемым
